In [1]:
import pandas as pd

In [2]:
data=pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\inputData.xlsx")
data

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
1      Vihaan  Deshmukh       88       81         85           89
2       Ayaan    Jadhav       90       75         88           84
3       Arjun      More       76       89         91           78
4     Reyansh     Joshi       82       80         84           85
..        ...       ...      ...      ...        ...          ...
60      Tarun    Dhumal       82       87         81           85
61      Arnav   Khedkar       85       90         78           89
62      Payal     Patil       89       76         87           91
63      Rahul     Kadam       81       83         84           90
64        Jay    Bhagat       90       77         65           88

[65 rows x 6 columns]

In [3]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
60     True
61     True
62     True
63     True
64    False
Length: 65, dtype: bool

In [4]:
data[data.duplicated()]

   First Name    Last Name  English  Physics  Chemistry  Mathematics
10      Aarav        Patil       85       78         90           92
11     Vihaan     Deshmukh       88       81         85           89
12      Ayaan       Jadhav       90       75         88           84
13      Arjun         More       76       89         91           78
14    Reyansh        Joshi       82       80         84           85
15     Vivaan         Nair       87       83         79           90
16     Aditya        Pawar       92       88         76           91
17      Rohan  Suryavanshi       78       82         90           86
18      Krish      Bhosale       80       85         83           89
19    Samarth       Shinde       89       79         87           88
43       Riya     Kulkarni       91       84         78           87
44      Anaya      Gawande       84       90         82           88
45       Isha       Kamble       79       76         89           92
46      Kaira        Nikam       88       80         84           90
47      Tejas     Waghmare       85       82         90           85
48    Rishabh       Ghadge       92       78         86           81
49      Kunal   Kshirsagar       81       81         85           88
50      Tanvi       Ingale       78       77         83           92
51      Disha       Chavan       86       83         80           89
52     Shreya     Dandekar       89       75         88           90
53      Aditi       Rajput       90       88         82           87
54    Radhika     Ghorpade       83       79         91           88
55     Nikhil     Patankar       87       80         89           84
56      Aarvi     Bhandari       90       81         85           91
57     Raghav     Khedekar       79       86         82           90
58      Sneha      Gokhale       88       84         90           86
59      Pooja       Mhatre       84       79         88           92
60      Tarun       Dhumal       82       87         81           85
61      Arnav      Khedkar       85       90         78           89
62      Payal        Patil       89       76         87           91
63      Rahul        Kadam       81       83         84           90

In [6]:
data[data.duplicated(subset=["First Name","Last Name"])]

   First Name    Last Name  English  Physics  Chemistry  Mathematics
10      Aarav        Patil       85       78         90           92
11     Vihaan     Deshmukh       88       81         85           89
12      Ayaan       Jadhav       90       75         88           84
13      Arjun         More       76       89         91           78
14    Reyansh        Joshi       82       80         84           85
15     Vivaan         Nair       87       83         79           90
16     Aditya        Pawar       92       88         76           91
17      Rohan  Suryavanshi       78       82         90           86
18      Krish      Bhosale       80       85         83           89
19    Samarth       Shinde       89       79         87           88
43       Riya     Kulkarni       91       84         78           87
44      Anaya      Gawande       84       90         82           88
45       Isha       Kamble       79       76         89           92
46      Kaira        Nikam       88       80         84           90
47      Tejas     Waghmare       85       82         90           85
48    Rishabh       Ghadge       92       78         86           81
49      Kunal   Kshirsagar       81       81         85           88
50      Tanvi       Ingale       78       77         83           92
51      Disha       Chavan       86       83         80           89
52     Shreya     Dandekar       89       75         88           90
53      Aditi       Rajput       90       88         82           87
54    Radhika     Ghorpade       83       79         91           88
55     Nikhil     Patankar       87       80         89           84
56      Aarvi     Bhandari       90       81         85           91
57     Raghav     Khedekar       79       86         82           90
58      Sneha      Gokhale       88       84         90           86
59      Pooja       Mhatre       84       79         88           92
60      Tarun       Dhumal       82       87         81           85
61      Arnav      Khedkar       85       90         78           89
62      Payal        Patil       89       76         87           91
63      Rahul        Kadam       81       83         84           90

In [7]:
data1=data.drop_duplicates(subset=["First Name","Last Name"])
data1

   First Name    Last Name  English  Physics  Chemistry  Mathematics
0       Aarav        Patil       85       78         90           92
1      Vihaan     Deshmukh       88       81         85           89
2       Ayaan       Jadhav       90       75         88           84
3       Arjun         More       76       89         91           78
4     Reyansh        Joshi       82       80         84           85
5      Vivaan         Nair       87       83         79           90
6      Aditya        Pawar       92       88         76           91
7       Rohan  Suryavanshi       78       82         90           86
8       Krish      Bhosale       80       85         83           89
9     Samarth       Shinde       89       79         87           88
20       Riya     Kulkarni       91       84         78           87
21      Anaya      Gawande       84       90         82           88
22       Isha       Kamble       79       76         89           92
23      Kaira        Nikam       88       80         84           90
24      Tejas     Waghmare       85       82         90           85
25    Rishabh       Ghadge       92       78         86           81
26      Kunal   Kshirsagar       81       81         85           88
27      Tanvi       Ingale       78       77         83           92
28      Disha       Chavan       86       83         80           89
29     Shreya     Dandekar       89       75         88           90
30      Aditi       Rajput       90       88         82           87
31    Radhika     Ghorpade       83       79         91           88
32     Nikhil     Patankar       87       80         89           84
33      Aarvi     Bhandari       90       81         85           91
34     Raghav     Khedekar       79       86         82           90
35      Sneha      Gokhale       88       84         90           86
36      Pooja       Mhatre       84       79         88           92
37      Tarun       Dhumal       82       87         81           85
38      Arnav      Khedkar       85       90         78           89
39      Payal        Patil       89       76         87           91
40      Rahul        Kadam       81       83         84           90
41       Jaya       Bhagat       92       88         76           89
42      Misha    Choudhary       78       85         90           86
64        Jay       Bhagat       90       77         65           88

In [8]:
data1.size

204

In [9]:
data.size

390

In [21]:
data.drop_duplicates(subset=["First Name","Last Name"],inplace=True)

In [19]:
data.size

204

In [20]:
data2

## Slicing Data from the pandas Dataframe

 1) loc for label-based slicing:Selecting rows and columns using labels # last index included
 2) iloc for positional slicing:Selecting rows and columns by integer position # last index excluded
 3) at for quick access to single values
 4) iat for quick access to single values by position

In [22]:
data

   First Name    Last Name  English  Physics  Chemistry  Mathematics
0       Aarav        Patil       85       78         90           92
1      Vihaan     Deshmukh       88       81         85           89
2       Ayaan       Jadhav       90       75         88           84
3       Arjun         More       76       89         91           78
4     Reyansh        Joshi       82       80         84           85
5      Vivaan         Nair       87       83         79           90
6      Aditya        Pawar       92       88         76           91
7       Rohan  Suryavanshi       78       82         90           86
8       Krish      Bhosale       80       85         83           89
9     Samarth       Shinde       89       79         87           88
20       Riya     Kulkarni       91       84         78           87
21      Anaya      Gawande       84       90         82           88
22       Isha       Kamble       79       76         89           92
23      Kaira        Nikam       88       80         84           90
24      Tejas     Waghmare       85       82         90           85
25    Rishabh       Ghadge       92       78         86           81
26      Kunal   Kshirsagar       81       81         85           88
27      Tanvi       Ingale       78       77         83           92
28      Disha       Chavan       86       83         80           89
29     Shreya     Dandekar       89       75         88           90
30      Aditi       Rajput       90       88         82           87
31    Radhika     Ghorpade       83       79         91           88
32     Nikhil     Patankar       87       80         89           84
33      Aarvi     Bhandari       90       81         85           91
34     Raghav     Khedekar       79       86         82           90
35      Sneha      Gokhale       88       84         90           86
36      Pooja       Mhatre       84       79         88           92
37      Tarun       Dhumal       82       87         81           85
38      Arnav      Khedkar       85       90         78           89
39      Payal        Patil       89       76         87           91
40      Rahul        Kadam       81       83         84           90
41       Jaya       Bhagat       92       88         76           89
42      Misha    Choudhary       78       85         90           86
64        Jay       Bhagat       90       77         65           88

In [23]:
data.size

204

In [24]:
dt=data.head(10)

In [25]:
dt

  First Name    Last Name  English  Physics  Chemistry  Mathematics
0      Aarav        Patil       85       78         90           92
1     Vihaan     Deshmukh       88       81         85           89
2      Ayaan       Jadhav       90       75         88           84
3      Arjun         More       76       89         91           78
4    Reyansh        Joshi       82       80         84           85
5     Vivaan         Nair       87       83         79           90
6     Aditya        Pawar       92       88         76           91
7      Rohan  Suryavanshi       78       82         90           86
8      Krish      Bhosale       80       85         83           89
9    Samarth       Shinde       89       79         87           88

In [26]:
data.loc[0]

First Name     Aarav
Last Name      Patil
English           85
Physics           78
Chemistry         90
Mathematics       92
Name: 0, dtype: object

In [30]:
dt.loc[0:4]

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85

In [31]:
dt.loc[0:4,["First Name","Chemistry","Mathematics"]]

  First Name  Chemistry  Mathematics
0      Aarav         90           92
1     Vihaan         85           89
2      Ayaan         88           84
3      Arjun         91           78
4    Reyansh         84           85

In [32]:
dt.iloc[0:4]

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78

In [38]:
# dt.iloc[0:4,["First Name","Chemistry","Mathematics"]] 
# throws error. iloc does not support index as string
#iloc requires numeric indexers, got ['First Name' 'Chemistry' 'Mathematics']

    0          1           2        3       4            5
First Name	Last Name	English	Physics	Chemistry	Mathematics
0	Aarav	Patil	      85	   78	   90	        92
1	Vihaan	Deshmukh	  88	   81	   85	        89
2	Ayaan	Jadhav	      90	   75	   88	        84
3	Arjun	More	      76	   89	   91	        78

In [39]:
dt.iloc[0:4,[1,3,5]] # providing number for the heading

  Last Name  Physics  Mathematics
0     Patil       78           92
1  Deshmukh       81           89
2    Jadhav       75           84
3      More       89           78

In [40]:
data.iloc[1]

First Name       Vihaan
Last Name      Deshmukh
English              88
Physics              81
Chemistry            85
Mathematics          89
Name: 1, dtype: object

In [42]:
data.size

204

In [44]:
data.loc[41]

First Name       Jaya
Last Name      Bhagat
English            92
Physics            88
Chemistry          76
Mathematics        89
Name: 41, dtype: object

In [48]:
data.loc[0:5] # last index included

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85
5     Vivaan      Nair       87       83         79           90

In [49]:
data.iloc[0:5] # last index not included

  First Name Last Name  English  Physics  Chemistry  Mathematics
0      Aarav     Patil       85       78         90           92
1     Vihaan  Deshmukh       88       81         85           89
2      Ayaan    Jadhav       90       75         88           84
3      Arjun      More       76       89         91           78
4    Reyansh     Joshi       82       80         84           85

In [50]:
data2=data.sort_values(by="Last Name",ascending=False)

In [51]:
data2

   First Name    Last Name  English  Physics  Chemistry  Mathematics
24      Tejas     Waghmare       85       82         90           85
7       Rohan  Suryavanshi       78       82         90           86
9     Samarth       Shinde       89       79         87           88
30      Aditi       Rajput       90       88         82           87
6      Aditya        Pawar       92       88         76           91
0       Aarav        Patil       85       78         90           92
39      Payal        Patil       89       76         87           91
32     Nikhil     Patankar       87       80         89           84
23      Kaira        Nikam       88       80         84           90
5      Vivaan         Nair       87       83         79           90
3       Arjun         More       76       89         91           78
36      Pooja       Mhatre       84       79         88           92
20       Riya     Kulkarni       91       84         78           87
26      Kunal   Kshirsagar       81       81         85           88
38      Arnav      Khedkar       85       90         78           89
34     Raghav     Khedekar       79       86         82           90
22       Isha       Kamble       79       76         89           92
40      Rahul        Kadam       81       83         84           90
4     Reyansh        Joshi       82       80         84           85
2       Ayaan       Jadhav       90       75         88           84
27      Tanvi       Ingale       78       77         83           92
35      Sneha      Gokhale       88       84         90           86
31    Radhika     Ghorpade       83       79         91           88
25    Rishabh       Ghadge       92       78         86           81
21      Anaya      Gawande       84       90         82           88
37      Tarun       Dhumal       82       87         81           85
1      Vihaan     Deshmukh       88       81         85           89
29     Shreya     Dandekar       89       75         88           90
42      Misha    Choudhary       78       85         90           86
28      Disha       Chavan       86       83         80           89
8       Krish      Bhosale       80       85         83           89
33      Aarvi     Bhandari       90       81         85           91
41       Jaya       Bhagat       92       88         76           89
64        Jay       Bhagat       90       77         65           88

In [52]:
data2.loc[0] # after sorting it takes the 0th index from the original table

First Name     Aarav
Last Name      Patil
English           85
Physics           78
Chemistry         90
Mathematics       92
Name: 0, dtype: object

In [54]:
data2.iloc[0] # after sorting it tales 0th index from the sorted data

First Name        Tejas
Last Name      Waghmare
English              85
Physics              82
Chemistry            90
Mathematics          85
Name: 24, dtype: object

In [55]:
# 1D:
# variable[0] ==> First element

# 2D: Excel file/ csv file
# variable[0] ==> First Record/ row
# variable[0      ,   0]  ==> first row first column element ==> Single value
# #      row index  column index

In [56]:
data2.head(10)

   First Name    Last Name  English  Physics  Chemistry  Mathematics
24      Tejas     Waghmare       85       82         90           85
7       Rohan  Suryavanshi       78       82         90           86
9     Samarth       Shinde       89       79         87           88
30      Aditi       Rajput       90       88         82           87
6      Aditya        Pawar       92       88         76           91
0       Aarav        Patil       85       78         90           92
39      Payal        Patil       89       76         87           91
32     Nikhil     Patankar       87       80         89           84
23      Kaira        Nikam       88       80         84           90
5      Vivaan         Nair       87       83         79           90

In [57]:
data2.loc[39]

First Name     Payal
Last Name      Patil
English           89
Physics           76
Chemistry         87
Mathematics       91
Name: 39, dtype: object

In [59]:
# data2.iloc[39]  not work
# throws error
# single positional indexer is out-of-bounds

In [60]:
data2.iloc[6]

First Name     Payal
Last Name      Patil
English           89
Physics           76
Chemistry         87
Mathematics       91
Name: 39, dtype: object

In [61]:
data2.iloc[0:3]

   First Name    Last Name  English  Physics  Chemistry  Mathematics
24      Tejas     Waghmare       85       82         90           85
7       Rohan  Suryavanshi       78       82         90           86
9     Samarth       Shinde       89       79         87           88

In [62]:
data2.loc[0:3]

   First Name Last Name  English  Physics  Chemistry  Mathematics
0       Aarav     Patil       85       78         90           92
39      Payal     Patil       89       76         87           91
32     Nikhil  Patankar       87       80         89           84
23      Kaira     Nikam       88       80         84           90
5      Vivaan      Nair       87       83         79           90
3       Arjun      More       76       89         91           78

In [63]:
## Take required columns data only

In [64]:
data.iloc[0,[0]]

First Name    Aarav
Name: 0, dtype: object

In [65]:
data.iloc[0:5,[0,1]]

  First Name Last Name
0      Aarav     Patil
1     Vihaan  Deshmukh
2      Ayaan    Jadhav
3      Arjun      More
4    Reyansh     Joshi

In [66]:
data.loc[0:4][["First Name","Last Name"]]

  First Name Last Name
0      Aarav     Patil
1     Vihaan  Deshmukh
2      Ayaan    Jadhav
3      Arjun      More
4    Reyansh     Joshi

In [67]:
# Excel/ Csv

# Indexing
# data[row_index, column_index]

# Slicing
# data[row_index_start:row_index_end, column_index_start:column_index_end / (Column index separated by comma in list)]